; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)

	       )

	       
  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty)
                           )
	     :effect
	     (and (not (ontable ?x))
	          (not (clear ?x))
	          (not (handempty))
	          (holding ?x)
		   ))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (and (holding ?x)
                           )
				
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)
		   ))

  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y)
				)
	     :effect
	     (and (not (holding ?x))
                  (not (clear ?y))
	          (clear ?x)
		  (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block )
             :precondition (and (on ?x ?y) (clear ?x) (handempty)
		     )
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
		   )
	     )

)

; problem
(define (problem prueba)
(:domain blocksworld)
(:objects A B C D E  - block
	  )
(:init
(handempty)
(clear A)
(ontable A) 
(clear B)
(ontable B)
(clear C)
(ontable C)
(clear D)
(ontable D)

)
(:goal
 (and
  (ontable B)
  (clear A)
  (on A B))
)
)

; plan
1. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 2 of 3
2. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 2 of 3
3. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 1 of 3
4. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 3 of 3
